Xinyuan-LilyGO/T-Panle-P4/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Example Configuration
#
CONFIG_EXAMPLE_ESP32P4_HOST_WIFI=y
# end of Example Configuration

#
# TinyUSB
#
CONFIG_TINYUSB_MSC_ENABLED=y

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# end of Compiler options

#
# Component config
#

#
# FAT Filesystem support
#
CONFIG_FATFS_VOLUME_COUNT=4
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_936=y
CONFIG_FATFS_CODEPAGE=936
CONFIG_FATFS_API_ENCODING_UTF_8=y
# CONFIG_FATFS_PER_FILE_CACHE is not set

#
# Virtual file system
#
CONFIG_VFS_MAX_COUNT=16

#
# Hardware Settings
#

#
# Chip revision
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# end of Chip revision
# end of Hardware Settings

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# PSRAM config
#
CONFIG_SPIRAM_SPEED_80M=y
# end of PSRAM config
# end of ESP PSRAM

#
# Espressif Camera Sensors Configurations
#

#
# Camera Sensor Configuration
#

#
# Select and Set Camera Sensor
#
CONFIG_CAMERA_OV2710=y

#
# Choose supported formats for MIPI CSI interface
#
CONFIG_CAMERA_OV2710_MIPI_RAW10_1280X720_25FPS=y
CONFIG_CAMERA_OV2710_MIPI_RAW10_1920X1080_25FPS=y
# end of Choose supported formats for MIPI CSI interface

# CONFIG_CAMERA_OV2710_MIPI_DEFAULT_FMT_RAW10_1280X720_25FPS is not set
CONFIG_CAMERA_OV2710_MIPI_DEFAULT_FMT_RAW10_1920X1080_25FPS=y
CONFIG_CAMERA_OV2710_MIPI_IF_FORMAT_INDEX_DEFAULT=0
# end of Select and Set Camera Sensor
# end of Camera Sensor Configuration
# end of Espressif Camera Sensors Configurations

#
# Configure host
#

#
# Features
#
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_AUTO_INIT=n
# end of Features
# end of Configure host

#
# Wi-Fi Remote
#
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y
# end of Wi-Fi Remote

#
# LVGL configuration
#

#
# Color Settings
#
CONFIG_LV_COLOR_DEPTH_24=y
# end of Color Settings

#
# HAL Settings
#
CONFIG_LV_DEF_REFR_PERIOD=20
# end of HAL Settings

#
# Rendering Configuration
#
CONFIG_LV_DRAW_BUF_ALIGN=64
# end of Rendering Configuration

#
# Font Usage
#

#
# Enable built-in fonts
#
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
# end of Enable built-in fonts

CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20=y
# end of Font Usage

#
# Others
#
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
# end of Others
# end of LVGL configuration

#
# ESP Audio Simple Player
#
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_FILE_EN=y
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_RESAMPLE_EN=y
CONFIG_AUDIO_SIMPLE_PLAYER_RESAMPLE_DEST_RATE=48000
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_CH_CVT_EN=y
CONFIG_AUDIO_SIMPLE_PLAYER_CH_CVT_DEST=2
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_BIT_CVT_EN=y
CONFIG_AUDIO_SIMPLE_PLAYER_BIT_CVT_DEST_16BIT=y
CONFIG_AUDIO_SIMPLE_PLAYER_BIT_CVT_DEST_BITS=16
# end of ESP Audio Simple Player

# end of Component config
CONFIG_LV_USE_LODEPNG=y
